src/srm_client/templates/RecoveryPlanSettings.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:srm0">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:RecoveryPlanSettings>
         <urn:_this type="SrmRecoveryPlan">SrmRecoveryPlan</urn:_this>
         <urn:name>{{ moref }}</urn:name>
      </urn:RecoveryPlanSettings>
   </soapenv:Body>
</soapenv:Envelope>